{"class_name": "Model", "keras_version": "2.1.6", "config": {"name": "mobilenet_1.00_224", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 224, 224, 3], "sparse": false}}, {"name": "conv1_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv1_pad", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv1", "class_name": "Conv2D", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv1", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [2, 2], "kernel_regularizer": null, "padding": "valid", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "filters": 32, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv1_relu", "class_name": "Activation", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"name": "conv1_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_1", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "config": {"name": "conv_pad_1", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv_dw_1", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv_dw_1", "depth_multiplier": 1, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_dw_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_1_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_dw_1_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "config": {"name": "conv_dw_1_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_1", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "name": "conv_pw_1", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "filters": 64, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_pw_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_1_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_pw_1_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "config": {"name": "conv_pw_1_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_2", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "config": {"name": "conv_pad_2", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv_dw_2", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv_dw_2", "depth_multiplier": 1, "trainable": true, "bias_regularizer": null, "strides": [2, 2], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_dw_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_2_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_dw_2_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "config": {"name": "conv_dw_2_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_2", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "name": "conv_pw_2", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "filters": 128, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_pw_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_2_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_pw_2_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "config": {"name": "conv_pw_2_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_3", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "config": {"name": "conv_pad_3", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv_dw_3", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_3", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv_dw_3", "depth_multiplier": 1, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_dw_3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_3_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_dw_3_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "config": {"name": "conv_dw_3_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_3", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "name": "conv_pw_3", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "filters": 128, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_pw_3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_3_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_pw_3_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "config": {"name": "conv_pw_3_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_4", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "config": {"name": "conv_pad_4", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv_dw_4", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv_dw_4", "depth_multiplier": 1, "trainable": true, "bias_regularizer": null, "strides": [2, 2], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_dw_4_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_4_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_dw_4_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "config": {"name": "conv_dw_4_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_4", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "name": "conv_pw_4", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "filters": 256, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_pw_4_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_4_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_pw_4_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "config": {"name": "conv_pw_4_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_5", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "config": {"name": "conv_pad_5", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv_dw_5", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_5", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv_dw_5", "depth_multiplier": 1, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_dw_5_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_5_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_dw_5_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "config": {"name": "conv_dw_5_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_5", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "name": "conv_pw_5", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "filters": 256, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_pw_5_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_5_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_pw_5_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "config": {"name": "conv_pw_5_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_6", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "config": {"name": "conv_pad_6", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv_dw_6", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv_dw_6", "depth_multiplier": 1, "trainable": true, "bias_regularizer": null, "strides": [2, 2], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_dw_6_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_6_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_dw_6_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "config": {"name": "conv_dw_6_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_6", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "name": "conv_pw_6", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "filters": 512, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_pw_6_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_6_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_pw_6_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "config": {"name": "conv_pw_6_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_7", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "config": {"name": "conv_pad_7", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv_dw_7", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_7", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv_dw_7", "depth_multiplier": 1, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_dw_7_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_7_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_dw_7_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "config": {"name": "conv_dw_7_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_7", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "name": "conv_pw_7", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "filters": 512, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_pw_7_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_7_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_pw_7_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "config": {"name": "conv_pw_7_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_8", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "config": {"name": "conv_pad_8", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv_dw_8", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_8", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv_dw_8", "depth_multiplier": 1, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_dw_8_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_8_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_dw_8_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "config": {"name": "conv_dw_8_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_8", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "name": "conv_pw_8", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "filters": 512, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_pw_8_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_8_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_pw_8_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "config": {"name": "conv_pw_8_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_9", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "config": {"name": "conv_pad_9", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv_dw_9", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_9", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv_dw_9", "depth_multiplier": 1, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_dw_9_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_9_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_dw_9_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "config": {"name": "conv_dw_9_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_9", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "name": "conv_pw_9", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "filters": 512, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_pw_9_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_9_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_pw_9_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "config": {"name": "conv_pw_9_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_10", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "config": {"name": "conv_pad_10", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv_dw_10", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_10", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv_dw_10", "depth_multiplier": 1, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_dw_10_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_10_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_dw_10_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "config": {"name": "conv_dw_10_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_10", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "name": "conv_pw_10", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "filters": 512, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_pw_10_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_10_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_pw_10_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "config": {"name": "conv_pw_10_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_11", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "config": {"name": "conv_pad_11", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv_dw_11", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_11", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv_dw_11", "depth_multiplier": 1, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_dw_11_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_11_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_dw_11_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "config": {"name": "conv_dw_11_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_11", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "name": "conv_pw_11", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "filters": 512, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_pw_11_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_11_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_pw_11_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "config": {"name": "conv_pw_11_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_12", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "config": {"name": "conv_pad_12", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv_dw_12", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv_dw_12", "depth_multiplier": 1, "trainable": true, "bias_regularizer": null, "strides": [2, 2], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_dw_12_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_12_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_dw_12_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "config": {"name": "conv_dw_12_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_12", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "name": "conv_pw_12", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "filters": 1024, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_pw_12_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_12_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_pw_12_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "config": {"name": "conv_pw_12_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pad_13", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "config": {"name": "conv_pad_13", "data_format": "channels_last", "trainable": true, "padding": [[1, 1], [1, 1]]}}, {"name": "conv_dw_13", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_13", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv_dw_13", "depth_multiplier": 1, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "depthwise_regularizer": null, "padding": "valid", "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_dw_13_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_13_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_dw_13_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "config": {"name": "conv_dw_13_relu", "trainable": true, "activation": "relu6"}}, {"name": "conv_pw_13", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "name": "conv_pw_13", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": false, "filters": 1024, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv_pw_13_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_13_bn", "beta_regularizer": null, "beta_constraint": null, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"name": "conv_pw_13_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "config": {"name": "conv_pw_13_relu", "trainable": true, "activation": "relu6"}}, {"name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "config": {"name": "global_average_pooling2d_1", "data_format": "channels_last", "trainable": true}}, {"name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "config": {"name": "reshape_1", "trainable": true, "target_shape": [1, 1, 1024]}}, {"name": "dropout", "class_name": "Dropout", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"name": "dropout", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.001}}, {"name": "conv_preds", "class_name": "Conv2D", "inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "name": "conv_preds", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "filters": 1000, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "act_softmax", "class_name": "Activation", "inbound_nodes": [[["conv_preds", 0, 0, {}]]], "config": {"name": "act_softmax", "trainable": true, "activation": "softmax"}}, {"name": "reshape_2", "class_name": "Reshape", "inbound_nodes": [[["act_softmax", 0, 0, {}]]], "config": {"name": "reshape_2", "trainable": true, "target_shape": [1000]}}], "output_layers": [["reshape_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}